/**物品类型 */
export const enum EItemType {
    /**道具 */
    prop = 1,
    /**装备 */
    equip = 2
}

/**颜色池子 */
export enum eColorPool {
    /**------------------装备---------------- */
    /**白色 */
    white = "#DCD3C7",
    /**绿色 */
    green = "#32C63D",
    /**蓝色 */
    bule = "#2E8DD6",
    /**紫色 */
    purple = "#D425D2",
    /**橙色 - boss*/
    orange = "#D96324",
    /** 红色  */
    red = "#ff0000"
}

/**1-90级 洗练的消耗 */
export var REMAKE_COSTCFG = [
    { lv: 1, quality: [1, 1, 4, 4], cost: 200 },
    { lv: 2, quality: [1, 1, 4, 4], cost: 200 },
    { lv: 3, quality: [2, 2, 8, 8], cost: 500 },
    { lv: 4, quality: [2, 2, 8, 8], cost: 500 },
    { lv: 5, quality: [4, 4, 16, 16], cost: 1500 },
    { lv: 6, quality: [4, 4, 16, 16], cost: 1500 },
    { lv: 7, quality: [8, 8, 20, 20], cost: 3000 },
    { lv: 8, quality: [8, 8, 20, 20], cost: 3000 },
    { lv: 9, quality: [16, 16, 40, 40], cost: 5000 }
];

/**装备类型 */
export enum EEquipType {
    /**背包 */
    bag = 1,
    /**人物 */
    role = 2
}

/**道具Id */
export const enum EItemKey {
    /**金币 */
    itemid_103035 = 103035,
    /**传送券 */
    itemid_103036 = 103036,
    /**元宝 */
    itemid_103037 = 103037,
    /** 经验 */
    itemid_103046 = 103046,
    /**古玩 */
    itemid_103038 = 103038,
    /**掉落金币 */
    itemid_103041 = 103041,
    /**微型金创药 */
    itemid_100010 = 100010,
    /**小量金创药 */
    itemid_100011 = 100011,
    /**中量金创药 */
    itemid_100012 = 100012,
    /**大量金创药 */
    itemid_100013 = 100013,
    /**强效金创药 */
    itemid_100014 = 100014,
    /**特效金创药 */
    itemid_100015 = 100015,
    /**微型魔法药 */
    itemid_100020 = 100020,
    /**小量魔法药 */
    itemid_100021 = 100021,
    /**中量魔法药 */
    itemid_100022 = 100022,
    /**大量魔法药 */
    itemid_100023 = 100023,
    /**强效魔法药 */
    itemid_100024 = 100024,
    /**特效魔法药 */
    itemid_100025 = 100025,

    /**弱效太阳水 */
    itemid_100030 = 100030,
    /**太阳水 */
    itemid_100031 = 100031,
    /**强效太阳水 */
    itemid_100032 = 100032,
    /**千年雪霜 */
    itemid_100033 = 100033,
    /**万年雪霜 */
    itemid_100034 = 100034,
    /**疗伤药 */
    itemid_100035 = 100035,

    /**技能丹 */
    itemid_103033 = 103033,
    /**洗练石 */
    itemid_103034 = 103034,
    /**矿工口粮 */
    itemid_103044 = 103044,
    /**火球术 */
    itemid_104001 = 104001,
    /**治愈术 */
    itemid_104002 = 104002,
    /**基本剑术 */
    itemid_104003 = 104003,
    /**精神力战法 */
    itemid_104004 = 104004,
    /**攻杀剑术 */
    itemid_104006 = 104006,
    /**施毒术 */
    itemid_104007 = 104007,
    /**雷电术 */
    itemid_104010 = 104010,
    /**灵魂火符 */
    itemid_104012 = 104012,
    /**神圣战甲术 */
    itemid_104014 = 104014,
    /**刺杀剑术 */
    itemid_104015 = 104015,
    /**烈火剑法 */
    itemid_104016 = 104016,
    /**野蛮冲撞 */
    itemid_104017 = 104017,
    /**魔法盾 */
    itemid_104021 = 104021,
    /**法术精通 */
    itemid_104022 = 104022,
    /**冰咆哮 */
    itemid_104023 = 104023,
    /**召唤术 */
    itemid_104025 = 104025,
    /**隐身术 */
    itemid_104026 = 104026,
    /**诱惑之光 */
    itemid_104028 = 104028,
    /**火墙 */
    itemid_104030 = 104030,
    /**半月弯刀 */
    itemid_104033 = 104033,
    /**护体真气 */
    itemid_104018 = 104018,
    /**无极真气 */
    itemid_104027 = 104027,
    /**书页 */
    itemid_104034 = 104034,
    /**----------------------------------残券---------------------------- */
    /**一级残券 */
    itemid_104101 = 104101,
    /**二级残券 */
    itemid_104102 = 104102,
    /**三级残券 */
    itemid_104103 = 104103,
    /**四级残券 */
    itemid_104104 = 104104,
    /**五级残券 */
    itemid_104105 = 104105,
    /**六级残券 */
    itemid_104106 = 104106,
    /**七级残券 */
    itemid_104107 = 104107,
    /**1元宝 */
    itemid_2101 = 2101,
    /**2元宝 */
    itemid_2102 = 2102,
    /**3元宝 */
    itemid_2103 = 2103,
    /**5元宝 */
    itemid_2104 = 2104,
    /**10元宝 */
    itemid_2105 = 2105,
    /**20元宝 */
    itemid_2106 = 2106,
    /**--------------------------------------------------------------------- */
    /**新手礼包 */
    itemid_2001 = 2001,
    /**8级礼包 */
    itemid_2002 = 2002,
    /**20级礼包 */
    itemid_2003 = 2003,
    /**30级礼包 */
    itemid_2004 = 2004,
    /**40级礼包 */
    itemid_2005 = 2005,
    /**50级礼包 */
    itemid_2006 = 2006,
    /**进群福利 */
    itemid_3001 = 3001,
    /**群福利礼包 */
    itemid_3002 = 3002,
    /**更新补偿礼包 */
    itemid_3003 = 3003,
    /**萌新福利 */
    itemid_3004 = 3004,
    /**五星好评 */
    itemid_3005 = 3005,
    /**新年快乐 */
    itemid_3006 = 3006,
    /**--装备兑换券-------------------------------------------------------- */
    /**黄金武器兑换券 */
    itemid_3100 = 3100,
    /**黄金甲兑换券 */
    itemid_3101 = 3101,
    /**黄金面具兑换券 */
    itemid_3102 = 3102,
    /**--战神，回收，免广告礼包等------------------------------------------- */
    /**战神7天 */
    itemid_3200 = 3200,
    /**战神30天 */
    itemid_3201 = 3201,
    /**战神90天 */
    itemid_3202 = 3202,
    /**回收7天 */
    itemid_3203 = 3203,
    /**回收30天 */
    itemid_3204 = 3204,
    /**回收90天 */
    itemid_3205 = 3205,
    /**免广告7天 */
    itemid_3206 = 3206,
    /**免广告30天 */
    itemid_3207 = 3207,
    /**免广告90天 */
    itemid_3208 = 3208,
    /**免广告永久 */
    itemid_3209 = 3209,
    /**托管7天 */
    itemid_3210 = 3210,
    /**托管30天 */
    itemid_3211 = 3211,
    /**托管90天 */
    itemid_3212 = 3212,
    /**托管永久 */
    itemid_3213 = 3213,
}

/**特殊的装备id */
export enum ESpecialEquipId {
    /**黄金裁决 */
    equip_hjcj = 205003,
    /**黄金骨玉 */
    equip_hjgy = 205004,
    /**黄金龙纹 */
    equip_hjlw = 205005,
    /**黄金甲 */
    equip_tmy = 205006,
    /**黄金面具 */
    equip_tlk = 205007
}